{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Armed group kills seven police officers in northern Burkina Faso - Reuters", "description": "Unidentified assailants killed seven police officers and wounded five more in northern Burkina Faso on Friday morning, the government said in a statement.", "url": "https://www.reuters.com/world/africa/armed-group-kills-seven-police-officers-northern-burkina-faso-2021-11-12/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=57", "publishedAt": "2021-11-12T23:36:00Z", "content": "OUAGADOUGOU, Nov 12 (Reuters) - Unidentified assailants killed seven police officers and wounded five more in northern Burkina Faso on Friday morning, the government said in a statement.\r\nThe officer… [+563 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Gunfight and siege in Kenya as police foil bank robbery - Reuters", "description": "Kenyan police firing automatic rifles and pistols laid siege to gunmen trying to rob a bank in the western city of Kisumu on Tuesday, foiling a heist but failing to prevent the assailants' escape after the five-hour confrontation.", "url": "https://www.reuters.com/world/africa/gunfight-siege-kenya-police-foil-bank-robbery-2021-11-23/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=60", "publishedAt": "2021-11-23T17:18:00Z", "content": "KISUMU, Kenya, Nov 23 (Reuters) - Kenyan police firing automatic rifles and pistols laid siege to gunmen trying to rob a bank in the western city of Kisumu on Tuesday, foiling a heist but failing to … [+1118 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Freight train derailed and burned in southern Chile amid indigenous conflict - Reuters", "description": "A freight train in southern Chile was derailed and some of its cargo units burned by unknown assailants on Tuesday, officials said, amid tensions between the state and the local Mapuche indigenous group demanding the return of ancestral lands.", "url": "https://www.reuters.com/world/americas/freight-train-derailed-burned-southern-chile-amid-indigenous-conflict-2021-11-02/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=55", "publishedAt": "2021-11-02T20:11:00Z", "content": "SANTIAGO, Nov 2 (Reuters) - A freight train in southern Chile was derailed and some of its cargo units burned by unknown assailants on Tuesday, officials said, amid tensions between the state and the… [+1205 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Two Israeli police officers stabbed, Palestinian assailant killed - police - Reuters", "description": "A 16-year-old Palestinian stabbed two Israeli police officers in Jerusalem's walled Old City on Wednesday before he was shot and killed by security forces at the scene, police said.", "url": "https://www.reuters.com/world/middle-east/two-israeli-police-officers-stabbed-palestinian-assailant-killed-police-2021-11-17/", "urlToImage": "https://www.reuters.com/resizer/oQc3mQjPeAAnr9ViRcmQTM_TcPI=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/RXG47RKO5NOC5GQU4YGJCH7QF4.jpg", "publishedAt": "2021-11-17T17:43:00Z", "content": "JERUSALEM, Nov 17 (Reuters) - A 16-year-old Palestinian stabbed two Israeli police officers in Jerusalem's walled Old City on Wednesday before he was shot and killed by security forces at the scene, … [+778 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Thieves rip bitcoin ATM from Barcelona crypto-store - Reuters", "description": "Spanish police are investigating the robbery of a 'bitcoin ATM' in a raid on a cryptocurrency exchange outlet in a wealthy Barcelona neighbourhood, local media reported on Friday.", "url": "https://www.reuters.com/world/thieves-rip-bitcoin-atm-barcelona-crypto-store-2021-11-12/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=57", "publishedAt": "2021-11-12T14:45:00Z", "content": "MADRID, Nov 12 (Reuters) - Spanish police are investigating the robbery of a 'bitcoin ATM' in a raid on a cryptocurrency exchange outlet in a wealthy Barcelona neighbourhood, local media reported on … [+1225 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Congo army says it has driven rebels out of eastern villages - Reuters", "description": "Democratic Republic of Congo's army said on Monday it had recovered two strategic villages near the eastern border with Uganda after they were seized overnight by fighters from the M23 rebel group.", "url": "https://www.reuters.com/world/africa/congo-army-says-it-has-driven-rebels-out-eastern-villages-2021-11-08/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=56", "publishedAt": "2021-11-08T17:55:00Z", "content": "GOMA, Democratic Republic of Congo, Nov 8 (Reuters) - Democratic Republic of Congo's army said on Monday it had recovered two strategic villages near the eastern border with Uganda after they were se… [+2356 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Hate crime or publicity stunt? Chicago jury selection opens in Jussie Smollett trial - Reuters", "description": "On a frigid Chicago night in January 2019, actor Jussie Smollett, a star on the TV drama \"Empire,\" reported that he was the victim of a hate-motivated street attack, but police later accused him of staging the whole affair as a publicity stunt.", "url": "https://www.reuters.com/world/us/hate-crime-or-publicity-stunt-chicago-jury-selection-opens-jussie-smollett-trial-2021-11-29/", "urlToImage": "https://www.reuters.com/resizer/w8HL5Lwm74oKplmMI8A-AuZh5J8=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/CUEJI3JY4NKATF2MWUNXGOVG6U.jpg", "publishedAt": "2021-11-29T17:43:00Z", "content": "Nov 29 (Reuters) - On a frigid Chicago night in January 2019, actor Jussie Smollett, a star on the TV drama \"Empire,\" reported that he was the victim of a hate-motivated street attack, but police lat… [+2312 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Towleroad", "title": "Hate crime or publicity stunt? Chicago jury selection opens in Jussie Smollett trial", "description": "Published by Reuters By Peter Szekely (Reuters) – On a frigid Chicago night in January 2019, actor Jussie Smollett, a star on the TV drama “Empire,” reported that he was the victim of a hate-motivated street attack, but police later accused him of staging the…", "url": "https://rmb.reuters.com/rmd/rss/item/tag:reuters.com,2021:newsml_KBN2IE1X1:1?channel=FES376", "urlToImage": "https://www.towleroad.com/wp-content/uploads/2021/11/469399-origin_1.jpg", "publishedAt": "2021-11-29T18:09:08Z", "content": "By Peter Szekely\r\n(Reuters) – On a frigid Chicago night in January 2019, actor Jussie Smollett, a star on the TV drama “Empire,” reported that he was the victim of a hate-motivated street attack, but… [+2233 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Eastern Congo lawmakers sound alarm over 144 violent civilian deaths this month", "description": "At least 144 civilians have been killed in eastern Congo this month, lawmakers from the conflict-hit provinces said on Wednesday, refusing to back extending a <a href=\"https://www.reuters.com/article/congo-security-idAFL8N2MO00E\" target=\"_blank\">state of sieg…", "url": "https://www.reuters.com/world/africa/eastern-congo-lawmakers-sound-alarm-over-144-violent-civilian-deaths-this-month-2021-11-17/", "urlToImage": "https://www.reuters.com/resizer/e2weOu-ZWBxrYw86Q0vL3bPdyn0=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/KSX74FFKIVLITP25HFIQ75N7IM.jpg", "publishedAt": "2021-11-17T22:05:48Z", "content": "Congolese civilians carry their belongings after fleeing from the renewed fighting between the assailants and army troops of the Democratic Republic of Congo and Uganda, at the Bunagana border crossi… [+2152 chars]"}]}