{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "Man to be freed after spending 43 years in prison for triple murder he didn't commit", "description": "After spending 43 years behind bars for a crime he said he didn't commit, a Missouri man's conviction has been set aside, according to a news release from Jackson County Prosecutor Jean Peters Baker.", "url": "https://www.cnn.com/2021/11/23/us/kevin-strickland-triple-murder-wrongful-conviction-freed-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110092020-kevin-strickland-wrongful-conviction-super-tease.jpg", "publishedAt": "2021-11-23T19:29:34Z", "content": "(CNN)After spending 43 years behind bars for a crime he said he didn't commit, a Missouri man's conviction has been set aside, according to a news release from Jackson County Prosecutor Jean Peters B… [+3023 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Rivers and Natalie Gallón, CNN", "title": "Nicaraguan exiles blame Ortega regime for attacks after 'sham' election win", "description": "Nicaragua's campaign to silence critics does not stop at its borders -- Costa Rican government sources and anecdotal evidence that agents of the Ortega regime have been stalking and threatening outspoken Nicaraguan exiles and, in some cases, are believed to h…", "url": "https://www.cnn.com/2021/11/08/americas/nicaragua-targets-exiles-ortega-election-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211108155008-daniel-ortega-rosario-murillo-10132018-super-tease.jpg", "publishedAt": "2021-11-08T23:03:46Z", "content": "(CNN)The man's voice trembled as he spoke, standing in the middle of an open field in southern Nicaragua. He was tense, despite the cool breeze and the mid-morning sunshine. If any of his government … [+12877 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "A man has spent 43 years in prison for a triple murder. He says he's innocent and prosecutors agree", "description": "A Missouri man who has maintained his innocence in a triple murder got an opportunity to testify at a three-day hearing that could lead to his release after serving 43 years in prison. That decision is now in a judge's hands.", "url": "https://www.cnn.com/2021/11/11/us/kevin-strickland-triple-murder-missouri-wrongful-conviction-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211110092020-kevin-strickland-wrongful-conviction-super-tease.jpg", "publishedAt": "2021-11-11T23:57:19Z", "content": "(CNN)A Missouri man who has maintained his innocence in a triple murder got an opportunity to testify at a three-day hearing that could lead to his release after serving 43 years in prison. That deci… [+7856 chars]"}]}