{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "CHINEDU ASADU Associated Press", "title": "6 people abducted from university in Nigeria’s capital", "description": "Authorities say gunmen in Nigeria’s capital abducted six people from the staff quarters of a university", "url": "https://abcnews.go.com/International/wireStory/people-abducted-university-nigerias-capital-80919625", "urlToImage": "https://s.abcnews.com/images/US/211101_vod_onlocation_hpMain_16x9_992.jpg", "publishedAt": "2021-11-02T10:53:39Z", "content": "LAGOS, Nigeria -- Gunmen in Nigeria's capital abducted six people from the staff quarters of a university, officials said Tuesday. It was the first attack of its kind in Lagos since a wave of school … [+1157 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "CHINEDU ASADU Associated Press", "title": "Gunmen kill 15 in latest attack in Nigeria’s northwest", "description": "Gunmen have killed at least 15 people in Nigeria’s northwest, the latest incident in a spiral of violence in Africa’s most populous country", "url": "https://abcnews.go.com/International/wireStory/gunmen-kill-15-latest-attack-nigerias-northwest-81199136", "urlToImage": "null", "publishedAt": "2021-11-16T10:51:30Z", "content": "LAGOS, Nigeria -- Gunmen have killed at least 15 people in Nigerias northwest, the Sokoto state governor said, the latest incident in a spiral of violence in Africas most populous country.\r\nThe gunme… [+1682 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Police: Roadside bomb kills 2 constables in NW Pakistan", "description": "Authorities say a roadside bomb has exploded in a tribal district that borders Afghanistan, killing two police", "url": "https://abcnews.go.com/International/wireStory/police-roadside-bomb-kills-constables-nw-pakistan-81147410", "urlToImage": "null", "publishedAt": "2021-11-13T07:39:13Z", "content": "KHAR, Pakistan -- A roadside bomb exploded in a tribal district that borders Afghanistan on Saturday, killing two police, authorities said.\r\nAbdus Samad Khan, Bajur District police chief, said the tw… [+647 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Official: Gunmen shoot dead 3 coal miners in SW Pakistan", "description": "Officials say gunmen have shot and killed three workers at a coal mine in southwestern Pakistan", "url": "https://abcnews.go.com/International/wireStory/official-gunmen-shoot-dead-coal-miners-sw-pakistan-81310867", "urlToImage": "null", "publishedAt": "2021-11-21T10:09:00Z", "content": "QUETTA, Pakistan -- Gunmen shot and killed three workers at a coal mine in southwestern Pakistan, officials said on Sunday. No one immediately claimed responsibility for the attack.\r\nSuhail Anwar Has… [+1011 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Roadside bomb targets Taliban, kills 2 in Afghanistan IS hub", "description": "Witnesses say a roadside bomb has struck a Taliban patrol in a stronghold of Islamic State militants in eastern Afghanistan", "url": "https://abcnews.go.com/International/wireStory/roadside-bomb-targets-taliban-kills-afghanistan-hub-80943770", "urlToImage": "null", "publishedAt": "2021-11-03T10:41:15Z", "content": "KABUL, Afghanistan -- A roadside bomb struck a Taliban patrol in a stronghold of Islamic State militants in eastern Afghanistan on Wednesday, killing two people and wounding three, witnesses said.\r\nT… [+1392 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "NOHA ELHENNAWY Associated Press", "title": "Libya: UN decries attack on court ahead of national vote", "description": "The UN mission in Libya condemns an attack by armed men on an appeals court as it was set to re-examine an earlier decision that disqualified the son of longtime dictator Moammar Gadhafi from running for president", "url": "https://abcnews.go.com/International/wireStory/libya-decries-attack-court-ahead-national-vote-81403715", "urlToImage": "null", "publishedAt": "2021-11-26T09:47:16Z", "content": "CAIRO -- The UN mission in Libya condemned on Friday an attack by armed men on an appeals court as it was set to re-examine an earlier decision that disqualified the son of longtime dictator Moammar … [+2393 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "CHINEDU ASADU Associated Press", "title": "Nearly 30 killed in violence across Nigeria’s north", "description": "Another round of violence across the northwest and central parts of Nigeria has led to the death of nearly 30 including police officers, according to locals and the authorities", "url": "https://abcnews.go.com/International/wireStory/30-killed-violence-nigerias-north-81087589", "urlToImage": "null", "publishedAt": "2021-11-10T17:24:15Z", "content": "LAGOS, Nigeria -- Nearly 30 people have been killed across Nigerias north in violent attacks in recent days targeting rural areas and the police, locals and authorities said Wednesday.\r\nThe three att… [+3073 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Attorney: Teens in KKK garb shocked Black teen with stun gun", "description": "The attorney for a Black teenager from Texas says several other teens attacked his client with a stun gun on Halloween while wearing costumes resembling Ku Klux Klan robes", "url": "https://abcnews.go.com/US/wireStory/attorney-teens-kkk-garb-shocked-black-teen-stun-81120518", "urlToImage": "null", "publishedAt": "2021-11-12T01:30:14Z", "content": "CORPUS CHRISTI, Texas -- The attorney for a Black teenager from Texas says several other teens attacked his client with a stun gun on Halloween while wearing costumes resembling Ku Klux Klan robes.\r\n… [+1408 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "New this week: 'Becoming Cousteau,' Gaga and Tony Bennett", "description": "This week’s new entertainment releases include the first ever album of covers by Deep Purple, an acclaimed documentary about undersea explorer Jacques-Yves Cousteau on Disney+ and a concert video of Tony Bennett and Lady Gaga", "url": "https://abcnews.go.com/Entertainment/wireStory/week-cousteau-gaga-tony-bennett-81327788", "urlToImage": "https://s.abcnews.com/images/Entertainment/WireAP_40c33b11e1e04ae68977192eb3abfe92_16x9_992.jpg", "publishedAt": "2021-11-22T14:56:58Z", "content": "Heres a collection curated by The Associated Press entertainment journalists of whats arriving on TV, streaming services and music platforms this week.\r\nMOVIES\r\n Stephen Karam adapts his Tony-winning… [+4733 chars]"}]}