{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "FABIOLA SÁNCHEZ / AP", "title": "Two People Have Been Killed in a Dramatic Shootout Near Upscale Holiday Resorts in Mexico", "description": "The dramatic shooting attack sent tourists scrambling for cover at the resort of Puerto Morelos, just south of Cancun.", "url": "https://time.com/6114116/drug-gangs-shooting-mexico-cancun-morelos-hyatt-azul/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/AP21308863896360.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-05T03:15:07Z", "content": "MEXICO CITY — A commando of drug gang gunmen on Thursday stormed ashore at a beach on Mexico’s resort-studded Caribbean coast in front of luxury hotels and executed two drug dealers from a rival gang… [+4172 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vlad Savov / Bloomberg", "title": "Why Exactly 310 of Robinhood’s 7 Million Cyber-Attack Victims Should Be Worried", "description": "Robinhood Markets Inc. announced on Monday an embarrassing security breach that exposed the personal information of millions of its users, which will be of particular concern to the 300 or so customers who suffered the worst privacy compromise. Most of the 7 …", "url": "https://time.com/6115891/robinhood-cyber-attack-victims/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/GettyImages-1331330476.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-10T10:52:41Z", "content": "Robinhood Markets Inc. announced on Monday an embarrassing security breach that exposed the personal information of millions of its users, which will be of particular concern to the 300 or so custome… [+2139 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "What Vladimir Putin Is Up To in Ukraine", "description": "In recent weeks, Russia has advanced more than 100,000 soldiers to its border with Ukraine. The Ukrainian government, fearing an attack, has called on Europe and the U.S. for help. A Kremlin spokesperson says Russia poses no threat to anyone, but its 2014 inv…", "url": "https://time.com/6122671/vladimir-putin-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/Putin-Ukraine-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-22T18:10:30Z", "content": "In recent weeks, Russia has advanced more than 100,000 soldiers to its border with Ukraine. The Ukrainian government, fearing an attack, has called on Europe and the U.S. for help. A Kremlin spokespe… [+3168 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "James Horn", "title": "How a Powhatan Tribal Chief Became One of Colonial America’s Greatest Military Leaders", "description": "During the late sixteenth century, a great American Indian chiefdom arose along the mid-Atlantic coast of North America. Named Tsenacommacah (densely inhabited land) by the peoples who lived along the rivers and shores of the Chesapeake Bay, the chiefdom stre…", "url": "https://time.com/6117487/opechananough-powhatan-chief/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/jamestown-settlers.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-17T18:42:51Z", "content": "During the late sixteenth century, a great American Indian chiefdom arose along the mid-Atlantic coast of North America. Named Tsenacommacah (densely inhabited land) by the peoples who lived along th… [+6812 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Hyung-Jin Kim/AP", "title": "Former South Korean Military Dictator Chun Doo-hwan Dies at 90", "description": "Hundreds of pro-democracy protesters were killed and tens of thousands were imprisoned during Chun Doo-hwan's presidency in the 1980s, but he allowed some liberalization after years of authoritarian rule.", "url": "https://time.com/6123012/chun-doo-hwan-dies-south-korea-dictator/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/Chun-Doo-hwan.jpg?quality=85&crop=0px%2C15px%2C2616px%2C1370px&resize=1200%2C628&strip", "publishedAt": "2021-11-23T05:32:36Z", "content": "(SEOUL, South Korea) — Former South Korean military strongman Chun Doo-hwan, who took power in a 1979 coup and brutally crushed pro-democracy protests before going to prison for misdeeds in office, d… [+4335 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aanu Adeoye", "title": "Ethiopia’s Tigray Conflict Demands International Attention. Time Is Running Out", "description": "Bridging the gap between the government and Tigrayan rebels requires cajoling by those who hold leverage. The U.S. has plenty.", "url": "https://time.com/6117801/ethiopia-tigray-conflict-diplomacy/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/GettyImages-1236407196.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-16T10:51:55Z", "content": "When Abiy Ahmed, Ethiopia’s prime minister, launched an attack on the restive region of Tigray in his country’s north last November, he promised it would be a swift victory for his forces. The goal, … [+5834 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ERIC TUCKER/AP", "title": "‘You’re Going to See More Arrests.’ Justice Department Cracks Down on Cybercrime", "description": "The Justice Department is stepping up actions to combat ransomware and cybercrime through arrests and other actions, officials say.", "url": "https://time.com/6113919/cyber-crackdown-justice-department/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/cyber-crackdown-justice-department.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-04T16:46:28Z", "content": "(WASHINGTON) — The Justice Department is stepping up actions to combat ransomware and cybercrime through arrests and other actions, its No. 2 official told The Associated Press, as the Biden administ… [+6635 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KEVIN FREKING and BRIAN SLODYSKO / AP", "title": "House Censures Rep. Paul Gosar Over Posting Violent Video Depicting Rep. Alexandria Ocasio-Cortez’s Killing", "description": "(WASHINGTON) — The House voted Wednesday to censure Republican Rep. Paul Gosar of Arizona for posting an animated video that depicted him killing Democratic Rep. Alexandria Ocasio-Cortez with a sword, an extraordinary rebuke that highlighted the political str…", "url": "https://time.com/6120913/paul-gosar-censure-violent-video/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/AP21321647952384-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-17T21:44:22Z", "content": "(WASHINGTON) — The House voted Wednesday to censure Republican Rep. Paul Gosar of Arizona for posting an animated video that depicted him killing Democratic Rep. Alexandria Ocasio-Cortez with a sword… [+6403 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Scott Bauer/AP", "title": "Boy, 8, Dies in Hospital After Being Struck in Waukesha Parade Crash", "description": "An 8-year-old boy became the sixth person to die Tuesday as a result of a man driving his SUV into a suburban Waukesha, Wisc., Christmas parade", "url": "https://time.com/6123571/child-dies-waukesha-parade-crash/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/Darrell-Brooks-Waukesha-Parade-Crash.jpg?quality=85&crop=0px%2C176px%2C4751px%2C2487px&resize=1200%2C628&strip", "publishedAt": "2021-11-24T02:41:26Z", "content": "An 8-year-old boy became the sixth person to die Tuesday as a result of a man driving his SUV into a suburban Milwaukee Christmas parade, with a criminal complaint alleging that the suspect in the ca… [+5303 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "3 Men Found Guilty of Felony Murder Charges in Trial Over Killing of Ahmaud Arbery", "description": "A jury on Wednesday found three white men guilty of murder, aggravated assault and false imprisonment in the shooting death of Ahmaud Arbery, an unarmed Black jogger who was chased down by the defendants as he jogged through their neighborhood. Travis McMicha…", "url": "https://time.com/6123299/ahmaud-arbery-trial-guilty-verdict/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/Arbery-verdict-11-23-21.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-24T18:54:25Z", "content": "A jury on Wednesday found three white men guilty of murder, aggravated assault and false imprisonment in the shooting death of Ahmaud Arbery, an unarmed Black jogger who was chased down by the defend… [+4216 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Pavel Alpeyev / Bloomberg", "title": "SoftBank Returns to Familiar Strategy After Portfolio Losses", "description": "A decline in the value of SoftBank Group's portfolio companies led to a record loss in its Vision Fund investment unit", "url": "https://time.com/6114837/softbank-earnings-loss-buyback/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/GettyImages-1229449370.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-08T15:42:50Z", "content": "Masayoshi Son said his SoftBank Group Corp. will buy back as much as 1 trillion yen ($8.8 billion) of its stock after a decline in the value of its portfolio companies led to a record loss in its Vis… [+5490 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Joe Biden Faces His Next Challenge on the Infrastructure Bill: Making Voters Care", "description": "The President was running late. It was one of Joe Biden’s first chances since his enormous bipartisan infrastructure bill passed Congress to beam directly into living rooms in Kentucky and Ohio and describe how it will will change daily commutes, water qualit…", "url": "https://time.com/6116363/joe-biden-infrastructure-bill-voters/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/joe-biden-bif-baltimore.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-10T22:29:58Z", "content": "The President was running late. It was one of Joe Biden’s first chances since his enormous bipartisan infrastructure bill passed Congress to beam directly into living rooms in Kentucky and Ohio and d… [+5923 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alberto Nardelli, Samy Adghirni and Jennifer Jacobs / Bloomberg", "title": "The U.S. and Its Allies Are Weighing Reprisals If Russia Invades Ukraine", "description": "U.S. officials have raised the idea of a package of measures in talks with European counterparts over the past week.", "url": "https://time.com/6119206/russia-ukraine-invasion/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/GettyImages-1235965583.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-16T03:44:54Z", "content": "The U.S. and its European allies are discussing potential responses if Russian President Vladimir Putin takes military action against Ukraine, including fresh sanctions on Moscow and further security… [+5676 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Chan", "title": "In the Kyle Rittenhouse Trial, Self-Defense Takes Center Stage", "description": "Prosecutors say Rittenhouse provoked violence, undercutting his self-defense claim. The defense says he did what he had to do to survive", "url": "https://time.com/6120607/kyle-rittenhouse-self-defense/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/kyle-rittenhouse-trial.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-17T18:49:37Z", "content": "Jurors in Kyle Rittenhouse’s polarizing murder trial have been deliberating whether the teenager acted in self-defense when he shot three people during protests in Wisconsin last year, but self-defen… [+5509 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jonathan Haidt and Caroline Mehl", "title": "How to Have Fun With That Relative Whose Opinions You Can’t Stand This Thanksgiving", "description": "As Americans prepare to host Thanksgiving dinners and other holiday meals, much attention is paid to the food served, the table setting, and the guest list. But is anyone setting the table for a good conversation? This year, you can. If you had the choice, wh…", "url": "https://time.com/6123239/politics-conversation-thanksgiving/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/Good-Holiday-Conversations-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-24T16:00:00Z", "content": "As Americans prepare to host Thanksgiving dinners and other holiday meals, much attention is paid to the food served, the table setting, and the guest list. But is anyone setting the table for a good… [+6295 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Mayors, Borough Bosses and Land Commissioners: Why Donald Trump Is Making Extremely Local Endorsements", "description": "During their local mayoral race in early November, town residents in Hialeah, Florida, population 230,000, heard a familiar voice in a campaign ad for the city’s election. “Steve Bovo,” boomed former President Donald Trump’s voice, in an ad spliced with video…", "url": "https://time.com/6123429/donald-trump-local-endorsements/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/trump-local-endorsements.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2021-11-29T12:00:02Z", "content": "During their local mayoral race in early November, town residents in Hialeah, Florida, population 230,000, heard a familiar voice in a campaign ad for the city’s election. “Steve Bovo,” boomed former… [+7031 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josh Boak and Colleen Long/AP", "title": "‘America Is Moving Again.’ Joe Biden Signs $1 Trillion Infrastructure Bill With Bipartisan Support", "description": "Biden hopes to sell the law as a success as he pivots to more difficult negotiations over the broader $1.85 trillion social spending package.", "url": "https://time.com/6118586/biden-infrastructure-bill/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/biden-infrastructure-bill.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-15T23:11:49Z", "content": "(WASHINGTON) — President Joe Biden signed his hard-fought $1 trillion infrastructure deal into law Monday before a bipartisan, celebratory crowd on the White House lawn, declaring that the new infusi… [+7959 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Leigh Butler", "title": "What to Know About The Wheel of Time Books Before Watching the Amazon Prime Series", "description": "There’s a lot of TV coming our way this holiday season, and one of the most buzzed-about shows out there is Amazon’s new fantasy series The Wheel of Time, developed by Rafe Jenkins and starring Rosamund Pike. As the series’ Nov. 19 premiere date approaches—wh…", "url": "https://time.com/6121275/wheel-of-time-books-explained/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/wot-rosamund-pike.jpeg?quality=85&w=700&h=466&crop=1", "publishedAt": "2021-11-18T20:39:09Z", "content": "There’s a lot of TV coming our way this holiday season, and one of the most buzzed-about shows out there is Amazon’s new fantasy series The Wheel of Time, developed by Rafe Jenkins and starring Rosam… [+8432 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "The Supreme Court Will Consider the Texas Abortion Law. Their Decision Could Change the Court—and the Country", "description": "The Supreme Court will hear oral arguments Monday in two cases about the controversial Texas law that has banned most abortions in the state. The eventual verdict could have extraordinary implications for abortion access, as well as a slew of other rights, na…", "url": "https://time.com/6111238/supreme-court-texas-abortion-law/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/10/GettyImages-1235022211.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-01T11:00:23Z", "content": "The Supreme Court will hear oral arguments Monday in two cases about the controversial Texas law that has banned most abortions in the state. The eventual verdict could have extraordinary implication… [+9875 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matthew Jacobs", "title": "How Waterbeds, Teen Love and an Unhinged Bradley Cooper Led To Licorice Pizza", "description": "Director Paul Thomas Anderson and star Alana Haim discuss the making of their sweet, California-drenched coming-of-age movie.", "url": "https://time.com/6122812/licorice-pizza-paul-thomas-anderson-alana-haim/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/licorice-pizza.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2021-11-23T13:00:08Z", "content": "Licorice Pizza, the new movie from writer-director Paul Thomas Anderson (There Will Be Blood, Phantom Thread), is a shaggy love story set in California’s San Fernando Valley in 1973. The protagonists… [+12332 chars]"}]}